{
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "∅": 4,
  "!": 5,
  "%": 6,
  "(": 7,
  ")": 8,
  "+": 9,
  ",": 10,
  "-": 11,
  ".": 12,
  "/": 13,
  "0": 14,
  "1": 15,
  "2": 16,
  "3": 17,
  "4": 18,
  "5": 19,
  "6": 20,
  "7": 21,
  "8": 22,
  "9": 23,
  ":": 24,
  ";": 25,
  "<": 26,
  "=": 27,
  ">": 28,
  "?": 29,
  "A": 30,
  "B": 31,
  "C": 32,
  "D": 33,
  "E": 34,
  "F": 35,
  "G": 36,
  "H": 37,
  "I": 38,
  "J": 39,
  "K": 40,
  "L": 41,
  "M": 42,
  "N": 43,
  "O": 44,
  "P": 45,
  "Q": 46,
  "R": 47,
  "S": 48,
  "T": 49,
  "U": 50,
  "V": 51,
  "W": 52,
  "X": 53,
  "Y": 54,
  "Z": 55,
  "[": 56,
  "\\%": 57,
  "\\Delta": 58,
  "\\Gamma": 59,
  "\\Lambda": 60,
  "\\Leftarrow": 61,
  "\\Leftrightarrow": 62,
  "\\Omega": 63,
  "\\Phi": 64,
  "\\Rightarrow": 65,
  "\\_": 66,
  "\\alpha": 67,
  "\\angle": 68,
  "\\approx": 69,
  "\\arccos": 70,
  "\\arcsin": 71,
  "\\arctan": 72,
  "\\ast": 73,
  "\\because": 74,
  "\\beta": 75,
  "\\bigcirc": 76,
  "\\bot": 77,
  "\\boxed": 78,
  "\\cap": 79,
  "\\cdot": 80,
  "\\cdots": 81,
  "\\circ": 82,
  "\\cong": 83,
  "\\cos": 84,
  "\\cot": 85,
  "\\cup": 86,
  "\\ddot": 87,
  "\\delta": 88,
  "\\div": 89,
  "\\dot": 90,
  "\\downarrow": 91,
  "\\epsilon": 92,
  "\\equiv": 93,
  "\\eta": 94,
  "\\forall": 95,
  "\\frac": 96,
  "\\gamma": 97,
  "\\geq": 98,
  "\\geqslant": 99,
  "\\in": 100,
  "\\infty": 101,
  "\\int": 102,
  "\\lambda": 103,
  "\\leftarrow": 104,
  "\\leq": 105,
  "\\lg": 106,
  "\\lim": 107,
  "\\limits": 108,
  "\\ln": 109,
  "\\log": 110,
  "\\mathop": 111,
  "\\max": 112,
  "\\mid": 113,
  "\\min": 114,
  "\\mu": 115,
  "\\neq": 116,
  "\\omega": 117,
  "\\overline": 118,
  "\\overrightarrow": 119,
  "\\partial": 120,
  "\\phi": 121,
  "\\pi": 122,
  "\\pm": 123,
  "\\prime": 124,
  "\\psi": 125,
  "\\rho": 126,
  "\\rightarrow": 127,
  "\\rightleftharpoons": 128,
  "\\sigma": 129,
  "\\sim": 130,
  "\\sin": 131,
  "\\sqrt": 132,
  "\\square": 133,
  "\\sum": 134,
  "\\supset": 135,
  "\\tan": 136,
  "\\tau": 137,
  "\\textcircled": 138,
  "\\therefore": 139,
  "\\theta": 140,
  "\\times": 141,
  "\\uparrow": 142,
  "\\varepsilon": 143,
  "\\varnothing": 144,
  "\\varphi": 145,
  "\\vdots": 146,
  "\\vert": 147,
  "\\widehat": 148,
  "\\xi": 149,
  "\\xlongequal": 150,
  "\\xrightarrow": 151,
  "\\zeta": 152,
  "\\{": 153,
  "\\}": 154,
  "]": 155,
  "^": 156,
  "_": 157,
  "a": 158,
  "b": 159,
  "c": 160,
  "d": 161,
  "e": 162,
  "f": 163,
  "g": 164,
  "h": 165,
  "i": 166,
  "j": 167,
  "k": 168,
  "l": 169,
  "m": 170,
  "n": 171,
  "o": 172,
  "p": 173,
  "q": 174,
  "r": 175,
  "s": 176,
  "t": 177,
  "u": 178,
  "v": 179,
  "w": 180,
  "x": 181,
  "y": 182,
  "z": 183,
  "{": 184,
  "}": 185
}