{
  "token2idx": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "!": 4,
    "(": 5,
    ")": 6,
    "+": 7,
    ",": 8,
    "-": 9,
    ".": 10,
    "/": 11,
    "0": 12,
    "1": 13,
    "2": 14,
    "3": 15,
    "4": 16,
    "5": 17,
    "6": 18,
    "7": 19,
    "8": 20,
    "9": 21,
    "<": 22,
    "=": 23,
    ">": 24,
    "A": 25,
    "B": 26,
    "C": 27,
    "E": 28,
    "F": 29,
    "G": 30,
    "H": 31,
    "I": 32,
    "L": 33,
    "M": 34,
    "N": 35,
    "P": 36,
    "R": 37,
    "S": 38,
    "T": 39,
    "V": 40,
    "X": 41,
    "Y": 42,
    "[": 43,
    "\\Delta": 44,
    "\\Pi": 45,
    "\\alpha": 46,
    "\\beta": 47,
    "\\cdot": 48,
    "\\cdots": 49,
    "\\cos": 50,
    "\\div": 51,
    "\\exists": 52,
    "\\forall": 53,
    "\\frac": 54,
    "\\gamma": 55,
    "\\geq": 56,
    "\\in": 57,
    "\\infty": 58,
    "\\int": 59,
    "\\lambda": 60,
    "\\ldots": 61,
    "\\leq": 62,
    "\\lim": 63,
    "\\limits": 64,
    "\\log": 65,
    "\\mu": 66,
    "\\neq": 67,
    "\\phi": 68,
    "\\pi": 69,
    "\\pm": 70,
    "\\prime": 71,
    "\\rightarrow": 72,
    "\\sigma": 73,
    "\\sin": 74,
    "\\sqrt": 75,
    "\\sum": 76,
    "\\tan": 77,
    "\\theta": 78,
    "\\times": 79,
    "\\{": 80,
    "\\}": 81,
    "]": 82,
    "^": 83,
    "_": 84,
    "a": 85,
    "b": 86,
    "c": 87,
    "d": 88,
    "e": 89,
    "f": 90,
    "g": 91,
    "h": 92,
    "i": 93,
    "j": 94,
    "k": 95,
    "l": 96,
    "m": 97,
    "n": 98,
    "o": 99,
    "p": 100,
    "q": 101,
    "r": 102,
    "s": 103,
    "t": 104,
    "u": 105,
    "v": 106,
    "w": 107,
    "x": 108,
    "y": 109,
    "z": 110,
    "{": 111,
    "|": 112,
    "}": 113
  },
  "idx2token": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "!",
    "5": "(",
    "6": ")",
    "7": "+",
    "8": ",",
    "9": "-",
    "10": ".",
    "11": "/",
    "12": "0",
    "13": "1",
    "14": "2",
    "15": "3",
    "16": "4",
    "17": "5",
    "18": "6",
    "19": "7",
    "20": "8",
    "21": "9",
    "22": "<",
    "23": "=",
    "24": ">",
    "25": "A",
    "26": "B",
    "27": "C",
    "28": "E",
    "29": "F",
    "30": "G",
    "31": "H",
    "32": "I",
    "33": "L",
    "34": "M",
    "35": "N",
    "36": "P",
    "37": "R",
    "38": "S",
    "39": "T",
    "40": "V",
    "41": "X",
    "42": "Y",
    "43": "[",
    "44": "\\Delta",
    "45": "\\Pi",
    "46": "\\alpha",
    "47": "\\beta",
    "48": "\\cdot",
    "49": "\\cdots",
    "50": "\\cos",
    "51": "\\div",
    "52": "\\exists",
    "53": "\\forall",
    "54": "\\frac",
    "55": "\\gamma",
    "56": "\\geq",
    "57": "\\in",
    "58": "\\infty",
    "59": "\\int",
    "60": "\\lambda",
    "61": "\\ldots",
    "62": "\\leq",
    "63": "\\lim",
    "64": "\\limits",
    "65": "\\log",
    "66": "\\mu",
    "67": "\\neq",
    "68": "\\phi",
    "69": "\\pi",
    "70": "\\pm",
    "71": "\\prime",
    "72": "\\rightarrow",
    "73": "\\sigma",
    "74": "\\sin",
    "75": "\\sqrt",
    "76": "\\sum",
    "77": "\\tan",
    "78": "\\theta",
    "79": "\\times",
    "80": "\\{",
    "81": "\\}",
    "82": "]",
    "83": "^",
    "84": "_",
    "85": "a",
    "86": "b",
    "87": "c",
    "88": "d",
    "89": "e",
    "90": "f",
    "91": "g",
    "92": "h",
    "93": "i",
    "94": "j",
    "95": "k",
    "96": "l",
    "97": "m",
    "98": "n",
    "99": "o",
    "100": "p",
    "101": "q",
    "102": "r",
    "103": "s",
    "104": "t",
    "105": "u",
    "106": "v",
    "107": "w",
    "108": "x",
    "109": "y",
    "110": "z",
    "111": "{",
    "112": "|",
    "113": "}"
  }
}